# St7GetBeamLineThickness

Returns the thickness of beam outlines.

long St7GetBeamLineThickness(long uID, long* Thickness)
Input Parameters
uID
Strand7 model file ID.
Output Parameters
Thickness
Beam outline thickness in the range kMinThickness to kMaxThickness.